import React from 'react';
import { Grid, Paper, Card, CardActionArea, CardMedia, CardContent,Typography, CardActions,Button } from '@material-ui/core';
import sample from '../Static/sample.jpg';

import useStyles from './homeStyles';

export const Home = () => {
    const classes = useStyles();
    return (
    <div>
        {/* Hemant Bhai intro home page */}
        <div className={classes.root}>
            <Grid container spacing={1} >
                <Grid item xs={12} md={3} >
                        <Card className={classes.card}>
                            <CardActionArea>
                                <CardMedia
                                    component="img"
                                    alt="Contemplative Reptile"
                                    height="140"
                                    image={sample}
                                    title="Contemplative Reptile"
                                />
                                <CardContent>
                                    <Typography gutterBottom variant="h6" component="h2">
                                        હેમંત નિર્ભયરામ ભાઈ ચાવડા
                                    </Typography>
                                    <Typography variant="body2" color="textSecondary" component="p">
                                        પ્રમુખ, ક.ગુ.ક્ષ.સ. રાયગઢ
                                    </Typography>
                                </CardContent>
                            </CardActionArea>
                        </Card>
                    </Grid>
                        <Grid item xs={12} md={9} >
                            <Typography>
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                            </Typography>
                        </Grid>
                </Grid>
        </div>
        {/* Usha ben intro home page */}
        <div className={classes.root}>
        <Grid container spacing={1} >
            <Grid item xs={12} md={3} >
                    <Card className={classes.card}>
                        <CardActionArea>
                            <CardMedia
                                component="img"
                                alt="Contemplative Reptile"
                                height="140"
                                image={sample}
                                title="Contemplative Reptile"
                            />
                            <CardContent>
                                <Typography gutterBottom variant="h6" component="h2">
                                    સુ. શ્રી ઉષા બેન ચૌહાણ
                                </Typography>
                                <Typography variant="body2" color="textSecondary" component="p">
                                    પ્રમુખ, મહિલા મંડળ, રાયગઢ
                                </Typography>
                            </CardContent>
                        </CardActionArea>
                    </Card>
                </Grid>
                    <Grid item xs={12} md={9} >
                        <Typography>
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        </Typography>
                    </Grid>
            </Grid>
    </div>
    {/* Chandresh Bhai intro home page */}
    <div className={classes.root}>
        <Grid container spacing={1} >
            <Grid item xs={12} md={3} >
                    <Card className={classes.card}>
                        <CardActionArea>
                            <CardMedia
                                component="img"
                                alt="Contemplative Reptile"
                                height="140"
                                image={sample}
                                title="Contemplative Reptile"
                            />
                            <CardContent>
                                <Typography gutterBottom variant="h6" component="h2">
                                    ચંદ્રેશ ભાઈ ટાંક
                                </Typography>
                                <Typography variant="body2" color="textSecondary" component="p">
                                    પ્રમુખ, યુવા મંડળ, રાયગઢ
                                </Typography>
                            </CardContent>
                        </CardActionArea>
                    </Card>
                </Grid>
                    <Grid item xs={12} md={9} >
                        <Typography>
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ શ્રી કચ્છ ગુર્જર ક્ષત્રિય સમાજ
                        </Typography>
                    </Grid>
            </Grid>
    </div>
    </div>
    );
}